# ClearItems Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainer..::..ClearItems Method
RebarContainer Class See Also
---
Clears all the Items stored in this Rebar Container element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void ClearItems()
```

Visual Basic
---
```text
Public Sub ClearItems
```

Visual C++
---
```text
public:
void ClearItems()
```

# See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace